app/controllers/boards_controller.rb

SELECT  "boards".* FROM "boards" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "boards"
---
	def index
		@boards = Board.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "boards" ("title", "content", "writer", "created_at", "updated_at", "wirter_pwd") VALUES (?, ?, ?, ?, ?, ?)  [["title", "123"], ["content", "312"], ["writer", "123"], ["created_at", 2017-03-23 12:22:52 UTC], ["updated_at", 2017-03-23 12:22:52 UTC], ["wirter_pwd", "312"]]
---
	def create
	  	@board = Board.new(board_params)
	  	if @board.save

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE (board_id = '1')
---
	def show
		@board = Board.find(params[:id])
		@comments = Comment.where("board_id = ?", params[:id])

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@board = Board.find(params[:id])

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
	def edit_chk
		@board = Board.find(params[:id])

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "boards" SET "content" = ?, "updated_at" = ? WHERE "boards"."id" = ?  [["content", "tttㅆㅆㅆ"], ["updated_at", 2017-03-21 11:35:49 UTC], ["id", 1]]
---
	def update
	  @board = Board.find(params[:id])
	  if @board.update_attributes(board_params)

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "board_id", "created_at", "updated_at", "wirter_pwd") VALUES (?, ?, ?, ?, ?)  [["comment", "234"], ["board_id", 9], ["created_at", 2017-03-27 03:03:06 UTC], ["updated_at", 2017-03-27 03:03:06 UTC], ["wirter_pwd", "12341"]]
---
	def comment_create
		@comment = Comment.new(comment_params)
		@board = Board.find(params[:board_id])
	  	if @comment.save